[
  {
    "id": 1,
    "attributes": {
      "title": "Création de mon CV / portfolio",
      "slug": "cv-portfolio",
      "summary": "Création de mon CV / portfolio afin de présenter mon parcours et mes compétences de manière claire et moderne. Ce projet me permet de mettre en pratique une stack technique que je maîtrise, tout en offrant une démonstration concrète de mon savoir-faire en matière de développement web et d’intégration. L’objectif est de disposer d’un support professionnel qui reflète à la fois mes compétences techniques et ma capacité à concevoir une interface soignée et fonctionnelle.",
      "status": "IN_PROGRESS",
      "detail": "Ce projet a pour objectif de concevoir un CV / portfolio moderne et évolutif, permettant de mettre en valeur mon parcours, mes compétences et mes réalisations. Au-delà d’un simple site vitrine, il s’agit d’un véritable terrain d’expérimentation technique dans lequel j’ai intégré une stack complète et cohérente, représentative de mon savoir-faire en développement web.\n\nLe frontend repose sur Vue 3 associé à Tailwind CSS, ce qui me permet de construire une interface claire, responsive et élégante. Grâce à Vue 3, je bénéficie d’une structure modulaire et performante, facilitant la maintenance et l’évolution du projet. Tailwind, quant à lui, m’offre une grande flexibilité dans le design, en garantissant un rendu moderne et homogène, tout en réduisant le temps consacré à la personnalisation des styles.\n\nPour la gestion de contenu, j’ai choisi Strapi, un CMS headless particulièrement adapté aux projets nécessitant une API souple et rapide à mettre en place. Strapi me permet de centraliser et d’organiser mes données (informations personnelles, projets, expériences, compétences) afin de les exposer de manière efficace et sécurisée au frontend.\n\nEn complément, j’ai développé un backend en Express dont le rôle est de générer et de builder les fichiers JSON destinés au frontend. Cette approche me permet de rendre le front totalement autonome : les pages consomment directement ces JSON préconstruits, ce qui élimine la dépendance à un serveur actif en production. Ainsi, le site peut être déployé et hébergé simplement sur GitHub Pages, tout en conservant une structure dynamique et facilement actualisable.\n\nAu niveau de l’interface, j’ai volontairement différencié deux approches graphiques. La page d’accueil, la liste des projets ainsi que le détail de chaque projet adoptent un style plus visuel et immersif, proche de celui d’un site vitrine. L’objectif est de capter l’attention, de mettre en valeur les réalisations et de renforcer l’impact esthétique dès le premier contact.\nÀ l’inverse, les pages consacrées aux expériences, à la formation, aux compétences et aux retours (feedback) s’orientent davantage vers une logique « logiciel », avec une présentation plus structurée, claire et fonctionnelle. Ce contraste permet d’allier l’aspect démonstratif et esthétique d’un portfolio à l’efficacité et la lisibilité d’un outil professionnel.\n\nCe projet représente pour moi une vitrine technique et professionnelle : il illustre ma capacité à concevoir un écosystème complet, depuis la gestion de contenu avec un CMS headless, jusqu’à l’intégration frontend moderne et performante, en passant par le développement backend et l’automatisation des données.",
      "locale": "fr-FR",
      "stack_items": {
        "data": [
          {
            "id": 9,
            "attributes": {
              "name": "Strapi",
              "info": "CMS headless open-source basé sur Node.js, offrant une API flexible et une interface d’administration moderne en React.",
              "locale": "fr-FR",
              "media": {
                "name": "strapi.jpg",
                "alternativeText": "Strapi logo",
                "original": {
                  "path": "original/strapi.jpg",
                  "height": 280,
                  "width": 280,
                  "mime": "image/jpeg",
                  "size": 7.58,
                  "strapiUrl": "/uploads/strapi_c6550c02fb.jpg"
                }
              }
            }
          },
          {
            "id": 4,
            "attributes": {
              "name": "ExpressJs",
              "info": "Framework minimaliste pour Node.js, spécialisé dans la création d’APIs REST et de middlewares performants.",
              "locale": "fr-FR",
              "media": {
                "name": "expressjs.png",
                "alternativeText": "Exoress js logo",
                "original": {
                  "path": "original/expressjs.png",
                  "height": 499,
                  "width": 1000,
                  "mime": "image/png",
                  "size": 16.56,
                  "strapiUrl": "/uploads/expressjs_a01a265d7b.png"
                }
              }
            }
          },
          {
            "id": 11,
            "attributes": {
              "name": "VueJs",
              "info": "Framework progressif JavaScript orienté composants, facilitant le développement d’interfaces modernes.",
              "locale": "fr-FR",
              "media": {
                "name": "vueJs.jpg",
                "alternativeText": "Vue js logo",
                "original": {
                  "path": "original/vueJs.jpg",
                  "height": 250,
                  "width": 250,
                  "mime": "image/jpeg",
                  "size": 6.33,
                  "strapiUrl": "/uploads/vue_Js_b140cc7b4a.jpg"
                }
              }
            }
          },
          {
            "id": 26,
            "attributes": {
              "name": "Tailwind CSS",
              "info": "Un framework CSS utilitaire rempli de classes qui peuvent être composées pour créer n'importe quelle conception.",
              "locale": "fr-FR",
              "media": {
                "name": "tailwind.jpg",
                "alternativeText": "Tailwind css logo",
                "original": {
                  "path": "original/tailwind.jpg",
                  "height": 102,
                  "width": 318,
                  "mime": "image/jpeg",
                  "size": 3.81,
                  "strapiUrl": "/uploads/tailwind_f1bc525407.jpg"
                }
              }
            }
          }
        ]
      },
      "webservices": {
        "data": []
      },
      "media": {
        "name": "capture_cv.png",
        "alternativeText": null,
        "original": {
          "path": "original/capture_cv.png",
          "height": 918,
          "width": 1893,
          "mime": "image/png",
          "size": 102.86,
          "strapiUrl": "/uploads/capture_cv_6e18636c45.png"
        }
      },
      "slider": {
        "id": 1,
        "title": "Présentation en images",
        "medias": [
          {
            "name": "cv-home-page-screenshot.png",
            "alternativeText": null,
            "original": {
              "path": "original/cv-home-page-screenshot.png",
              "height": 926,
              "width": 1897,
              "mime": "image/png",
              "size": 102.16,
              "strapiUrl": "/uploads/cv_home_page_screenshot_b218b4715b.png"
            }
          },
          {
            "name": "cv-project-detail-page-screenshot.png",
            "alternativeText": "Screen shot du détail d'un projet",
            "original": {
              "path": "original/cv-project-detail-page-screenshot.png",
              "height": 927,
              "width": 1900,
              "mime": "image/png",
              "size": 79.5,
              "strapiUrl": "/uploads/cv_project_detail_page_screenshot_6e4aee7216.png"
            }
          },
          {
            "name": "cv-experience-page-screenshot.png",
            "alternativeText": "Présentation de mes expériences sous forme application logicielle.",
            "original": {
              "path": "original/cv-experience-page-screenshot.png",
              "height": 925,
              "width": 1898,
              "mime": "image/png",
              "size": 56.29,
              "strapiUrl": "/uploads/cv_experience_page_screenshot_ba6571007b.png"
            }
          },
          {
            "name": "capture_cv.png",
            "alternativeText": null,
            "original": {
              "path": "original/capture_cv.png",
              "height": 918,
              "width": 1893,
              "mime": "image/png",
              "size": 102.86,
              "strapiUrl": "/uploads/capture_cv_6e18636c45.png"
            }
          }
        ]
      },
      "link": [
        {
          "id": 1,
          "title": "Projet GitHub",
          "url": "https://github.com/fmasdev/fmasdev.github.io",
          "info": null
        }
      ]
    }
  },
  {
    "id": 2,
    "attributes": {
      "title": "Media management",
      "slug": "medias-management",
      "summary": "Application de gestion multimédia permettant de récupérer les photos et vidéos depuis Google Photos, de synchroniser un media center, un disque dur externe et un réplicat compressé (bz2) avec sauvegarde sur plusieurs clouds. Elle inclut également un Kanban pour le suivi des tâches.",
      "status": "TASKS_WRITING",
      "detail": "Une application permétant de :\n- récupérer des photos et vidéos des comptes google photo\n- de faire un sync entre : \n    - media center\n    - disque dur externe \n    - un réplicat du disque dur avec les photos en bz2\n    - une synchronisation du réplicat sur un ou plusieurs clouds\n\nKanban des taches en cours de réalisation.\nLes langages et frameworks a utiliser ne sont pas encore définis.",
      "locale": "fr-FR",
      "stack_items": {
        "data": []
      },
      "webservices": {
        "data": []
      },
      "media": {
        "name": "og-experience.jpg",
        "alternativeText": "project not realized",
        "original": {
          "path": "original/og-experience.jpg",
          "height": 853,
          "width": 1280,
          "mime": "image/jpeg",
          "size": 93.25,
          "strapiUrl": "/uploads/og_experience_d70ee23bd4.jpg"
        }
      },
      "slider": null,
      "link": [
        {
          "id": 2,
          "title": null,
          "url": null,
          "info": null
        }
      ]
    }
  }
]
